public enum Planet {
    MERCURY("Кунго эн жакын байланышкан планета, жана кун системасындагы эн кичине плаента " +
            "болуп саналат диаметри болгону 4800  км",2400),
    VENUS("кун системасындагы планеталардын арасында эн жарык жана эн ысык планета болуп эсептелет, " +
            "диаметри боюнча башкача айтканда өлчөмү менен 3чу орунда жайгашкан радиусу ->  км", 6051.8),
    EARTH("Биздин уй жана азыркы убакка чеин жалгыз жашоо бар планета Жер болуп эсептелет өлчөмү боюнча " +
            "4 плаента болуп саналат радиусу ->  км",6371),
    MARS(" Марс эн кызыктуу жана корокм тасмалар жакшы коргон оюнчу,адам баласы эн коп изилдей алган плаента" +
            "болуп эсептелет башка плаенталарга салыштырганда, эн кызыктуу планеталардын бири деп ойлойм PS. тусу кызыл" +
            "значит спортивный ;) радиусу ->  км  ",3389.5),
    JUPITER("Кун системасынлагы эн чон планета Гигант болуп саналат Юпитерди биринчилерден Галилео Галилей" +
            "астроному 1610 жылы ачкан Юпитерде эн чон океан жайгашкан кун системасындагы плаенталардын арасында бирок " +
            "суу эмес водород жайгашкан океанда  радиусу ->  км",69911),
    SATURN("Сатурн Кооз планеталардын бири себеи планетаны озгочо 7 шакек курчап турат  азыр айтып кеткендей Юпитер " +
            "сымал Гигант планеталарга кирет өлчөмү боюнча 2 чи орунда турат Юпитерден кийин эле радиусу ->  км",58232),
    URANUS("Муздуу гигант плента болуп саналат жана бул Венера планетасында толук карама каршы температурасына байланыштуу " +
            " буга чеин айтылган Юпитер менен Сатурн гигант плаенталардан кийин турат чондугу " +
            "боюнча радиусу ->  км",25362),
    NEPTUNE("Нептун Кундон эн алыски планента болуп саналат. Нептунда алмаздардан жаан жамгыр жайт жана бир гана ушул " +
            " планетадада күн системасындагы эн ылдам шамалдарга, кээ бир шамалдаодын " +
            "ылдамдыгы 2400км/саатка чеин барат радиусу ->  км",24622),
    PLUTO("Бул планетага 11 жаштагы кыз Венеция Берни ат берген жана Плутондун журогу бар абдан чоо кратер характерлуу формада " +
            "1600 чакырымга чеин жетет радиусу ->  км",1183),
    SUN("Акыры кунго да жеттик кун планета эмес жылдыз болуп саналат бирок менин подборкама кошоюн деп чечтим. Кун жок болсо биздин плаента " +
            "башка планеталарга да терс таасири тиймек Кун системасында Кун 99,86% пайыз массасын камтыйт жана эн чон " +
            "жана өлчөмүдүү тело болуп саналат радиусу ->  км", 696340);

    private String factsAboutThePlanets;
    private double radius;

    Planet() {
    }

    Planet(String factsAboutThePlanets, double radius) {
        this.factsAboutThePlanets = factsAboutThePlanets;
        this.radius = radius;
    }
    public String getFactsAboutThePlanets(){
        return factsAboutThePlanets;
    }

    public double getRadius() {
        return radius;
    }
}

